Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.AngleUnitEnum
The angle unit type.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.AngleUnitEnum.DEG
Degrees.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.AngleUnitEnum.RAD
Radians.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.AngleUnitEnum.UNKNOWN
unknown unit.